results/cpu-vs-latency5/memcached/8-3/nsl202.out
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  30 secs]  0 threads:     2615137 ops,   99129 (avg:   87169) ops/sec, 3.74MB/sec (avg: 3.29MB/sec),  1.29 (avg:  1.47) msec latency

8         Threads
16        Connections per thread
30        Seconds
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets        7926.49          ---          ---      1.46700       587.55
Gets       79242.84      9896.82     69346.02      1.46500      2778.70
Totals     87169.33      9896.82     69346.02      1.46500      3366.24


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.000     84.93566
SET       2.000     90.51304
SET       3.000     99.98823
SET       4.000     99.99495
SET       5.000     99.99622
SET       6.000     99.99790
SET       9.000    100.00000
---
GET       0.078      0.00004
GET       0.087      0.00008
GET       0.095      0.00013
GET       0.110      0.00042
GET       0.120      0.00067
GET       0.130      0.00114
GET       0.140      0.00261
GET       0.150      0.00463
GET       0.160      0.00707
GET       0.170      0.00955
GET       0.180      0.01232
GET       0.190      0.01662
GET       0.200      0.02166
GET       0.210      0.02701
GET       0.220      0.03491
GET       0.230      0.04307
GET       0.240      0.05094
GET       0.250      0.05994
GET       0.260      0.06739
GET       0.270      0.07306
GET       0.280      0.07836
GET       0.290      0.08589
GET       0.300      0.09292
GET       0.310      0.09776
GET       0.320      0.10247
GET       0.330      0.10865
GET       0.340      0.11530
GET       0.350      0.12148
GET       0.360      0.12636
GET       0.370      0.13048
GET       0.380      0.13481
GET       0.390      0.14070
GET       0.400      0.14638
GET       0.410      0.15021
GET       0.420      0.15471
GET       0.430      0.15946
GET       0.440      0.16523
GET       0.450      0.16998
GET       0.460      0.17431
GET       0.470      0.17915
GET       0.480      0.18449
GET       0.490      0.19068
GET       0.500      0.19560
GET       0.510      0.19921
GET       0.520      0.20388
GET       0.530      0.20868
GET       0.540      0.21297
GET       0.550      0.21596
GET       0.560      0.21903
GET       0.570      0.22243
GET       0.580      0.22672
GET       0.590      0.23144
GET       0.600      0.23505
GET       0.610      0.23871
GET       0.620      0.24254
GET       0.630      0.24662
GET       0.640      0.25188
GET       0.650      0.25596
GET       0.660      0.25937
GET       0.670      0.26290
GET       0.680      0.26711
GET       0.690      0.27152
GET       0.700      0.27535
GET       0.710      0.27939
GET       0.720      0.28237
GET       0.730      0.28679
GET       0.740      0.29167
GET       0.750      0.29630
GET       0.760      0.30076
GET       0.770      0.30614
GET       0.780      0.31262
GET       0.790      0.32036
GET       0.800      0.32818
GET       0.810      0.33710
GET       0.820      0.34673
GET       0.830      0.35910
GET       0.840      0.37121
GET       0.850      0.38446
GET       0.860      0.40024
GET       0.870      0.41912
GET       0.880      0.43957
GET       0.890      0.46434
GET       0.900      0.49274
GET       0.910      0.52740
GET       0.920      0.57241
GET       0.930      0.63071
GET       0.940      0.70962
GET       0.950      0.82327
GET       0.960      1.00600
GET       0.970      1.31210
GET       0.980      1.83558
GET       0.990      2.74063
GET       1.000     23.99757
GET       1.100     60.98079
GET       1.200     62.77612
GET       1.300     63.12353
GET       1.400     63.22086
GET       1.500     64.37161
GET       1.600     74.46016
GET       1.700     81.66183
GET       1.800     83.30897
GET       1.900     84.77620
GET       2.000     85.47976
GET       2.100     88.67708
GET       2.200     90.23841
GET       2.300     90.42109
GET       2.400     90.45600
GET       2.500     90.46929
GET       2.600     90.47615
GET       2.700     90.48503
GET       2.800     90.49546
GET       2.900     90.51237
GET       3.000     90.57172
GET       3.100     90.99375
GET       3.200     93.47324
GET       3.300     97.37761
GET       3.400     99.28252
GET       3.500     99.86245
GET       3.600     99.97299
GET       3.700     99.98780
GET       3.800     99.98906
GET       3.900     99.98957
GET       4.000     99.98990
GET       4.100     99.99049
GET       4.200     99.99192
GET       4.300     99.99327
GET       4.400     99.99441
GET       4.500     99.99478
GET       4.600     99.99546
GET       4.700     99.99575
GET       4.800     99.99596
GET       4.900     99.99600
GET       5.000     99.99605
GET       5.200     99.99609
GET       5.300     99.99613
GET       5.400     99.99626
GET       5.500     99.99634
GET       5.600     99.99642
GET       5.700     99.99655
GET       5.800     99.99680
GET       5.900     99.99701
GET       6.100     99.99710
GET       6.300     99.99748
GET       6.400     99.99819
GET       8.400     99.99823
GET       9.000     99.99849
GET       9.100     99.99882
GET       9.200     99.99903
GET       9.400     99.99912
GET       9.800     99.99920
GET       9.900     99.99924
GET      10.000     99.99979
GET      11.000    100.00000